### Pandas Library

In [2]:
import pandas as pd

In [3]:
data = [4,5,4,7,8,9,6,5,3,2,4,1]
series = pd.Series(data)
print(series)

0     4
1     5
2     4
3     7
4     8
5     9
6     6
7     5
8     3
9     2
10    4
11    1
dtype: int64

In [4]:
series = pd.Series(data, index=["A","B","C","D","F","I","J","K","L","M","N","P"])
print(series)

A    4
B    5
C    4
D    7
F    8
I    9
J    6
K    5
L    3
M    2
N    4
P    1
dtype: int64

In [5]:
data = {"Name": ["ash","emma","peter","moses"],
       "Age": [10,26,45,32],
       "City": ["new york","london","paris","tokyo"]}
df = pd.DataFrame(data)
print(df)

    Name  Age      City
0    ash   10  new york
1   emma   26    london
2  peter   45     paris
3  moses   32     tokyo

In [7]:
df.head()

    Name  Age      City
0    ash   10  new york
1   emma   26    london
2  peter   45     paris
3  moses   32     tokyo

In [9]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes
None

In [10]:
print(df.describe())

            Age
count   4.00000
mean   28.25000
std    14.52297
min    10.00000
25%    22.00000
50%    29.00000
75%    35.25000
max    45.00000